In [1]:
import numpy as np
import pandas as pd
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
missing_values = ["n/a", "na", "--", "-", " ", "NAN", "nan", "Nan", "NaN"] # Additional NaN possibilities
df = pd.read_csv("archive/aug_train.csv", na_values = missing_values)

df.head()

,enrollee_id,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,8949,city_103,0.920,Male,Has relevent experience,no_enrollment,Graduate,STEM,>20,NaN,NaN,1,36,1.0
1,29725,city_40,0.776,Male,No relevent experience,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,11561,city_21,0.624,NaN,No relevent experience,Full time course,Graduate,STEM,5,NaN,NaN,never,83,0.0
3,33241,city_115,0.789,NaN,No relevent experience,NaN,Graduate,Business Degree,<1,NaN,Pvt Ltd,never,52,1.0
4,666,city_162,0.767,Male,Has relevent experience,no_enrollment,Masters,STEM,>20,50-99,Funded Startup,4,8,0.0

In [3]:
df['major_discipline'].unique()

array(['STEM', 'Business Degree', nan, 'Arts', 'Humanities', 'No Major',
       'Other'], dtype=object)

In [4]:
df = df.drop("enrollee_id", axis=1)

In [5]:
df = df.dropna(subset=['gender', 'enrolled_university', 'education_level', 'experience', 'last_new_job'], axis = 0, how='any')
df.reset_index(drop=True, inplace=True)

In [6]:
df.isnull().sum()

city                         0
city_development_index       0
gender                       0
relevent_experience          0
enrolled_university          0
education_level              0
major_discipline          1674
experience                   0
company_size              4022
company_type              4138
last_new_job                 0
training_hours               0
target                       0
dtype: int64

In [7]:
# Create binary values for relevant experience
for i in df["relevent_experience"]:
    if(i == "Has relevent experience"):
        df["relevent_experience"][df["relevent_experience"]==i]=1
    if(i == "No relevent experience"):
        df["relevent_experience"][df["relevent_experience"]==i]=0
        
df["relevent_experience"] = df["relevent_experience"].astype('int')

<ipython-input-7-5467c37165ff>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["relevent_experience"][df["relevent_experience"]==i]=0

In [8]:
# Change experience above 20 and less than 1
for i in df["experience"]:
    if(i==">20"):
        df["experience"][df["experience"]==i]=21
    if(i == "<1"):
        df["experience"][df["experience"]==i]=0

df["experience"] = df['experience'].astype('int')

<ipython-input-8-e8d2d7a528d4>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["experience"][df["experience"]==i]=21
<ipython-input-8-e8d2d7a528d4>:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["experience"][df["experience"]==i]=0

In [13]:
for i in range(len(df)):
    if (df['education_level'][i] == 'High School') or (df['education_level'][i] == "Primary School"):
        df['major_discipline'][i] = 'Not applicable'
df = df.dropna(subset=['major_discipline'], axis = 0, how='any')

df["company_type"] = df["company_type"].fillna("Undefined")

<ipython-input-13-e57783a41f80>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df['major_discipline'][i] = 'Not applicable'

In [14]:
df['major_discipline'].unique()

array(['STEM', 'Not applicable', 'Arts', 'Humanities', 'Business Degree',
       'No Major', 'Other'], dtype=object)

In [15]:
for i in df["company_size"]:
    if(i=="10/49"):
        df["company_size"][df["company_size"]==i]="10-49"
    if(i == "<10"):
        df["company_size"][df["company_size"]==i]="1-9"
    if(i == "10000+"):
        df["company_size"][df["company_size"]==i]="10000-100000"

df["company_size"] = df["company_size"].fillna("0")

df.head()

<ipython-input-15-45c859ea66f5>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["company_size"][df["company_size"]==i]="1-9"
<ipython-input-15-45c859ea66f5>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["company_size"][df["company_size"]==i]="10-49"
<ipython-input-15-45c859ea66f5>:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["company_size"][df["company_size"]==i]="10000-100000"

,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,city_103,0.920,Male,1,no_enrollment,Graduate,STEM,21,0,Undefined,1,36,1.0
1,city_40,0.776,Male,0,no_enrollment,Graduate,STEM,15,50-99,Pvt Ltd,>4,47,0.0
2,city_162,0.767,Male,1,no_enrollment,Masters,STEM,21,50-99,Funded Startup,4,8,0.0
3,city_160,0.920,Male,1,no_enrollment,High School,Not applicable,5,50-99,Funded Startup,1,24,0.0
4,city_46,0.762,Male,1,no_enrollment,Graduate,STEM,13,1-9,Pvt Ltd,>4,18,1.0

In [16]:
for i in df["last_new_job"]:
    if(i==">4"):
        df["last_new_job"][df["last_new_job"]==i]=5
    if(i == "never"):
        df["last_new_job"][df["last_new_job"]==i]=0

df["last_new_job"] = df["last_new_job"].fillna(0)       

df["last_new_job"] = df['last_new_job'].astype('int')
df["last_new_job"].unique()

<ipython-input-16-cf1354bdc61e>:3: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["last_new_job"][df["last_new_job"]==i]=5
<ipython-input-16-cf1354bdc61e>:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["last_new_job"][df["last_new_job"]==i]=0

array([1, 5, 4, 3, 2, 0])

In [18]:
df.reset_index(drop=True, inplace=True)

for i in range(len(df["city"])):
    df["city"][i] = df["city"][i].replace("city_","")

df["city"] = df['city'].astype('int')

<ipython-input-18-21c6d4afc7ab>:4: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df["city"][i] = df["city"][i].replace("city_","")

array([103,  40, 162, 160,  46,  61, 114,  13, 159, 100,  21,  16, 104,
       101,  83,  64, 105,  73,  67,  75,  93,  36,  71,  57, 152,  65,
        11, 136,  98,  97,  50, 173, 138,  82, 102,  90,  89, 150,  28,
       115,  94, 165, 142,  26,  12,  43,  74, 116, 157,  99,  23,  45,
       128,  70, 158,  41,  72,  19,  20, 106, 143,  78,  10, 123, 109,
        24, 144,  91, 133, 145, 175, 134,   9, 149, 167,  84,  54, 126,
        39,  77,  81, 176, 131,  27, 118, 141,  76, 117, 127,  62,  53,
         7,   2, 120, 111,  48,   1, 140,  80, 155, 179,  44,  37,  30,
        14,  55,  42,  59,  33,  69, 107,  25, 139,  18, 180, 146, 166,
       121, 129,   8,  31])

In [19]:
for column in df.columns:
    if df[column].dtype == "object":
        df[column] = df[column].astype("category")
        df[column] = df[column].cat.codes.astype("int64")

In [20]:
df.info()
df.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 14142 entries, 0 to 14141
Data columns (total 13 columns):
 #   Column                  Non-Null Count  Dtype
---  ------                  --------------  -----
 0   city                    14142 non-null  int64
 1   city_development_index  14142 non-null  float64
 2   gender                  14142 non-null  int64
 3   relevent_experience     14142 non-null  int64
 4   enrolled_university     14142 non-null  int64
 5   education_level         14142 non-null  int64
 6   major_discipline        14142 non-null  int64
 7   experience              14142 non-null  int64
 8   company_size            14142 non-null  int64
 9   company_type            14142 non-null  int64
 10  last_new_job            14142 non-null  int64
 11  training_hours          14142 non-null  int64
 12  target                  14142 non-null  float64
dtypes: float64(2), int64(11)
memory usage: 1.4 MB

,city,city_development_index,gender,relevent_experience,enrolled_university,education_level,major_discipline,experience,company_size,company_type,last_new_job,training_hours,target
0,103,0.920,1,1,2,0,6,21,0,6,1,36,1.0
1,40,0.776,1,0,2,0,6,15,6,5,5,47,0.0
2,162,0.767,1,1,2,2,6,21,6,1,4,8,0.0
3,160,0.920,1,1,2,1,4,5,6,1,1,24,0.0
4,46,0.762,1,1,2,0,6,13,1,5,5,18,1.0